[General]
Translator, "Ahmad AlS, Ahmed Altaai, mabrouk74690, MajKSA, MFM Dawdeh, MFM Dawdeh33547"
LangVersion, "6.3.0.0"
LangKeysTotal, "739"
LangKeysComplete, "717"
GeneratedDateTimeUTC, "Dec 18, 2019 19:34 (UTC)"
GenerationTimeMS, "35"


[Icon]
R0lGODlhEAAMAOYAAHebhkuBYqPGpFadWwR6NlCGZgB2L0ufbgJ4Mk6EZUuBYZ3CpXawe2+qh3Ww
eou3kp3DpUyBYUyDY4G0l6m0rsva0rXTwmOsgmauhGCmfWuxiWmngXKwe02caMzc03OyjEyZVl+q
f6Wzp52wpXSXgGqUe2muhm+teJLCp1aJa3S0j2qTe3a3kWGOdEuYVpC3oGambG+xi466kpG3oHGX
gU+hclemeKTLtpK7o1+le2uohW6phl+qflaJbGCqfoq2kTiRXIGzlVihcLDRv5O7pDeQWmWma3Sy
jWCOdJTApU+GZam0rY+7k5O/pXS0jgV6Nkqgbgh8OQF4MxqGRzOTW2CqfwB4MnCzjIGhjgR6NYSW
iwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACH5
BAAAAAAALAAAAAAQAAwAAAeRgCNYg4SFhSIAV4qLKk6LiwA0VZNVPkcVHh88IZQkK1CgB0kCHCcC
TQegUCVIVK4ZMkIYLB1MOa5ULT1TvBNGJhcaMTBBvFMpBVHKOi4oNTY3IBvKUQUJT08EQD8MQxYO
D0UE2AlKUucIDQsDAxA7COdSEgFW9VYGRDMvOAb2VgERsggcSJCggiVaEipcuJBCIAA7


[BFAPI]
ErrorClientVersionTooOld, "اصدار العميل; قديم جدا.\nيرجى تحديث التطبيق وحاول مرة اخرى."
ErrorFailClientTime, "لم يتم تعيين ساعة الحاسوب بشكل صحيح\nالرجاء التحقق من وقت نظامك وحاول مرة اخر"
ErrorFailLogin, "تحقق من عنوان بريدك; الالكتروني وكلمة سرك وحاول مرة اخرى"
ErrorFailPrefix, "Binary Fortress فشل الاتصال بحسابك ل\nالرجاء التحقق من اتصالك; بالانترنت، وتحقق من ان هذا التطبيق لا يتم حظره من قبل وكيل او جدار حماية على حاسوبك او الشبكة."
ErrorInvalidProTrialLicenseKey, "صلاحية ترخيصك التجريبي يبدو باطل.\nيرجى الاتصال بنا للحصول على مزيد من المعلومات."
ErrorItemSizeTooLarge, "واحد من العناصر التي تحاول مزامنة كبير جدا.\nسوف تحتاج الى حذف هذا البند الكبير وحاول المزامنة مرة اخرى."
ErrorTrialExpiredPrompt, "انتهت صلاحية الترخيص التجريبي برو.\nهل ترغب في الاتصال بنا والبدء في صلاحية ترخيص اخرى؟"
ErrorTwoFactorInvalid, "رمز التحقق بخطوتين غير صالح أو منتهي الصلاحية. \nالرجاء إعادة المحاولة."
ErrorUnknownProPurchasedLicenseKey, "مفتاح الترخيص يبدو باطل.\nيرجى الاتصال بنا للحصول على مزيد من المعلومات."
LoginPrompt, "تحتاج إلى إدخال معلومات تسجيل الدخول إلى البرنامج لتحيين معلومات التعريف الخاصة بك.\nهل ترغب في إدخال معلومات تسجيل الدخول الخاصة بك الآن؟"
PromptTwoFactor, "يرجى إدخال رمز التحقق بخطوتين الذي تم إرساله للتو إلى جهازك. \nإذا لم تحصل عليه في غضون بضع دقائق، يرجى الاتصال بدعم Fortress Support."
PromptTwoFactorImportOldCredentials, "هذا التطبيق يدعم الآن المصادقة بخطوتين، وأنت فعلته على حسابك. \n\nيرجى إدخال رمز التحقق بخطوتين الذي تم إرساله للتو إلى جهازك. \nإذا لم تحصل عليه في غضون بضع دقائق، يرجى الاتصال بدعم Binary Fortress."
PromptTwoFactorTOTP, "الرجاء إدخال الرمز المكون من 6 أرقام الذي تم إنشاؤه بواسطة تطبيق أداة مصادقة الجوال. إذا كان لديك أي مشاكل مع كود الموثق الخاص بك ، يرجى الاتصال بدعم Binary Fortress."
TitleSync, "Binary Fortress المزامنة مع حسابك"


[BFAPILoginControl_Controls]
btnLogin, "تسجيل الدخول"
btnLogout, "تسجيل الخروج"
btnMyAccount, "حسابي"
btnMyLicenses, "رخصتي"
btnRegister, "‏‏تسجيل"
btnResetPassword, "استرجاع كلمة السر"
lblEmailAddress, "عنوان البريد الكتروني"
lblName, ":الأسم"
lblPassword, "كلمة السر"


[BFAPILoginControl_LicenseRestrictions]
LicenseRestrictionBlock, "شخصي او شركة، # المشار اليه في اسم الترخيص"
LicenseRestrictionEnterprise, "الحاسبات الغير محدودة في شركة الغير محدودة المواقع"
LicenseRestrictionPersonal, "أجهزة كمبيوتر شخصية غير محدودة، وجهاز كمبيوتر للشركة واحد تستخدمه أنت فقط"
LicenseRestrictionSite, "اجهزة الحواسيب غير محدود في الموقع 1"
LicenseRestrictionStandard, "شخصي او شركة، حاسوب 1"
LicenseRestrictionSteam, "شخصي او شركة، غير محدودة من اجهزة الحاسوب المستخدم الرئيسي لك ويتم دفع تثبيتة"


[BFAPILoginControl_Strings]
ErrorEnterEmailAddress, "الرجاء ادخال عنوان بريد الكتروني صالح وحاول مرة اخرى"
ErrorEnterPassword, "الرجاء ادخال كلمة سرك وحاول ثانية"
ErrorLoginFailed, "فشل في تحميل معلومات حسابك د\nالرجاء التحقق من عنوان بريدك الالكتروني وكلمة سرك وحاول مرة اخرى"
ErrorNoLicensesFound, "ناسف، لا يمكن ان نجد اي معلومات ترخيص من اجل هذا الحساب\nاذا كنت بحاجة الى اي مساعدة، يرجى الاتصال"
ErrorUnknownLicenses, "حدث خطا اثناء تحميل معلومات ترخيصك"
ErrorUnknownLogin, "حدث خطا اثناء تحميل معلومات حسابك"
Note, "تسجيل الدخول لاسترداد مفتاح ترخيصك، والمزامنة مع حسابك"Binary Fortress""
SelectLicensePrompt, "انت الان تستخدم الاصدار المجاني، على ترخيص تجريبي المحترف، او مفتاح الترخيص باطل.\n هل ترغب في تحميل مفتاح الترخيص من حسابك لBinary Fortress؟"
Title, "حسابي على Binary Fortress"
TitleLoadingLicenses, "تحميل معلومات الرخصة"


[BFFormAPIMyLicenses_Controls]
colDateCreated, "تاريخ الانشاء"
colDateExpires, "تاريخ انتهاء الصلاحية"
colLicenseKey, "مفتاح الرخصة"
colLicenseRestrictions, "قيود الرخصة"
colLicenseType, "نوع الترخيص"
colName, "اسم الرخصة"


[BFFormAPIMyLicenses_Strings]
ConfirmUseLicense, "هل تريد استخدام مفتاح الترخيص هذا؟"
ErrorSelectLicense, "الرجاء تحديد الرخصة من القائمة.حاول مرة اخرى"
ShowNeedLicenseWarning, "حدد احد مفاتيح رخصتك من القائمة ثم انقر زر موافق لاستخدام مفتاح الترخيص هذا"
Title, "رخصتي"


[BFFormCodeEditor]
btnHotKeyEdit, "تعديل"
btnInsertFunction, "إدراج تعليمات برمجية"
btnInsertFunctionTT, "استعراض قائمة بالوظائف الجاهزة لمساعدتك في إنشاء الوظيفة الجديدة"
btnRedoTT, "إعادة (Ctrl + Y)"
btnReferencesDefault, "المراجع الافتراضية"
btnRunFunction, "تشغيل الوظيفة"
btnRunFunctionTT, "تشغيل الوظيفة الحالية"
btnUndoTT, "تراجع"
btnVerifyFunction, "التحقق من الوظيفة"
btnVerifyFunctionTT, "التحقق من أكواد الوظيفة الحالية دون تشغيلها"
ErrorCompileFailed, "فشل بناء الوظيفة"
ErrorEnterCode, "أدخل بعض أكواد #C أو VB.net ثم حاول مرة أخرى"
ErrorEnterName, "أدخل اسما ثم أعد المحاولة"
ErrorRunFailed, "فشل التشغيل"
lblDescription, "الوصف:"
lblHelp, "مساعدة حول الوظائف"
lblKeyCombination, "تجميعة مفاتيح"
lblLanguage, "اللغة"
lblName, ":الأسم"
lblReferences, "المراجع"
lblShare, "مشاركة الكود الخاص بك مع المجتمع!"
MessageRunning, "‏‏قيد التشغيل"
MessageRunSuccess, "نجح التشغيل"
MessageVerifySuccess, "التحقق ناجح"
MessageWait, "في انتظار انتهاء الوظيفة النصية\nيمكنك استخدام أيقونة الوظائف النصية الموجودة في شريط المهام بالكمبيوتر لإيقاف الوظيفة"
MessageWaitTitle, "في انتظار الوظيفة"
PromptChangeLanguage, "هل تود تحميل الكود الخاص بالوظيفة النصية التلقائية؟\nتحذير: هذا سيمسح أي تعديلات قمت بها على الوظيفة النصية."
PromptCloseWithoutSave, "هل أنت متأكد أنك تود الإغلاق دون حفظ؟"
PromptDefaultReferences, "هل أنت متأكد أنك تود إعادة كل المراجع للضبط الافتراضي؟"
PromptInvalidSave, "هذه الوظيفة النصية تبدو غير صالحة.\nهل أنت متأكد أنك تريد حفظها على كل حال؟"
ShareMessage, "سيتم إرفاق الكود الخاص بك بهذا الطلب تلقائيا. \nإذا كنت تريد إرسال رسالة، فيرجى إدخالها فوق السطر الفاصل. شكر!"
ShareSubject, "وظيفة نصية:"
ShareTitle, "شارك الوظيفة النصية"
ShareWarning, "اسمك سوف يستخدم لحفظ حقك الأدبي، من فضلك أخبرنا إن كنت تود استخدام اسم مستعا أو أن تشاركها كمجهول."


[BFFormCodeEditorLookups]
PromptSelectWindowStyles, "الرجاء اختيار نمط النوافذ:"
PromptSelectWindowStylesEx, "الرجاء تحديد نمط النوافذ الموسعة:"
RemoveConfirmOne, "هل تريد بالتأكيد إزالة العنصر المحدد؟"
SelectAnItem, "الرجاء تحديد عنصر من القائمة وإعادة المحاولة."
SelectAudioDevice, "الرجاء تحديد جهاز صوت."
SelectMouseCursorLocation, "انقر لتحديد موقع مؤشر الفأرة اضغط على أي مفتاح للإلغاء"
SendKeys_EditString, "تحرير النص"
SendKeys_EnterString, "أدخل النص:"
SendKeys_mniAddKeyCombination, "إضافة تركيبة مفاتيح"
SendKeys_mniAddRawText, "إضافة نص خام"
SendKeys_mniAddText, "إضافة نص"
SendKeys_Title, "منشئ SendKeys"


[BFFormDownload_Strings]
ConfirmCancel, "هل تريد الغاء التحميل"
Error, "لقد حدث خطا"
Progress, "(المتبقية: {0} ك ب (مجموع {1} ك. ب"
ProgressUnknown, "جاري التحميل: {0} ك. ب"


[BFFormGetWallpaperFusionTag]
ErrorSelectTag, "يرجى تحديد علامة WallpaperFusion وحاول مرة اخرى."
lblQuery, "تصفية:"
Title, "WallpaperFusion علامات"


[BFFormOnlineMacroBrowser]
btnClose, "إغلاق"
colContributors, "المساهمون"
colCreatedBy, "انشئت بواسطة"
colDownloads, "التنزيلات"
colLanguage, "اللغة"
colLastModified, "اخر تعديل"
lblQuery, "تصفية:"
Loading, "تحميل..."


[BFFormProxySettings_Controls]
btnSave, "حفظ"
lblProxyAddress, "عنوان الخادم:"
lblProxyPassword, "كلمة السر"
lblProxyPassword2, "اعادة كلمة السر:"
lblProxyPort, "منفذ:"
lblProxyUsername, "اسم المستخدم:"
rdoCustomSettings, "استخدم اعدادات خادم الوكيل المخصص"
rdoNoProxy, "لايوجد خادم للوكيل(للاتصال بالانترنت مباشرة("
rdoUseIESettings, "استخدام اعدادات اتصال انترنت اكسبلورر"


[BFFormProxySettings_Strings]
EnterServerAddress, "الرجاء ادخال عنوان خادم الوكيل او لا تحدد خادم الوكيل"
EnterServerPort, "الرجاء ادخال منفذ خادم الوكيل او لا تحدد خادم الوكيل"
PasswordDecryptionFailed, "ويبدو ان لديك اعدادات اتصال انترنت لاغية.\nهل ترغب في اعادة ادخال كلمة سر وكيل خادمك لاصلاح هذه الاعدادات؟"
PasswordsNotMatch, "كلمات خادم وكيلك لا تتطابق الرجاء المحاولة مرة اخرى"
Title, "اعدادات الاتصال بالانترنت"


[BFFormSelectApplication]
AllApplications, "كل التطبيقات"
btnBrowse, "استعراض"
colApplication, "التطبيق"
colPath, "مسار"
GroupDesktopApplications, "تطبيقات سطح المكتب"
GroupWindows8Applications, "Windows Universal Applications"
lblWindowPicker, "اسحب هذا اطار لتحديد العملية تلك النافذة في القائمة تلقائيا"
PleaseSelectApplication, "الرجاء تحديد التطبيق اولا"
Title, "حدد التطبيق"


[BFFormSettingsAdvanced_Controls]
btnDelete, "القيمة الافتراضية"
chkShowOnlyModified, "فقط عرض القيم المعدلة"
colSetting, "اعداد"
colValue, "القيمة"
lblFilter, "تصفية:"
lblHelp, "انقر نقرا مزدوجا فوق الاعداد لتغييره، انقر فوق زر 'تعليمات' للحصول على مزيد من المعلومات"


[BFFormSettingsAdvanced_Strings]
ErrorSaving, "حدث خطا اثناء حفظ هذا الاعداد"
SavedSuccessfully, "تم حفظ الاعدادات المتقدمة بنجاح.\nقد تحتاج الى اعادة تشغيل التطبيق ليصبح الاعداد نافذ المفعول."
Title, "الاعدادات المتقدمة"
TitleEdit, "تحرير الاعدادات المتقدمة"


[BFFormSettings_Controls]
btnAdvancedSettings, "الاعدادات المتقدمة"
btnAutoUpdateCheckNow, "تحقق من وجود تحديثات الان"
btnBackupSettings, "تصدير الاعدادات"
btnLanguageHelp, "المساعدة على إنهاء الترجمة"
btnLicenseChangeToFree, "تغيير الى النسخة المجانية"
btnLicenseKeyRequestTrial, "طلب رخصة تجريبية جديدة"
btnLicenseKeyRestoreTrial, "استعادة مفتاح الترخيص التجريبي"
btnLicenseLoadOnline, "التحميل من حساب Binary Fortress"
btnLicensePasteFromClipboard, "لصق من الحافظة"
btnProxySettings, "اعدادات الاتصال بالانترنت"
btnRestoreSettings, "استعادة الاعدادات"
btnTroubleshootingClearLogBASE, "مسح السجل"
btnTroubleshootingCopyBASE, "نسخ المعلومات إلى الحافظة"
btnTroubleshootingExportBASE, "تصدير المعلومات إلى ملف"
btnTroubleshootingForceCleanupBASE, "فرض تنظيف الذاكرة"
btnTroubleshootingOpenLogBASE, "افتح السّجل"
btnTroubleshootingRefreshBASE, "تحديث"
chkAutoUpdate, "تحقق من وجود تحديثات تلقائيا"
chkAutoUpdateBeta, "تحقق من وجود اصدار بيتا جديد (احدث وغير مستقرة)"
chkAutoUpdateSteam, "تحقق من وجود تحديثات بشكل تلقائي. يمكن التغاضي عنها Steam عن هذا الاعداد"
colLanguageName, "الأسم"
colLanguagePercentComplete, "اكتمل"
colLanguageTranslators, "المترجمون"
colLanguageVersion, "الاصدار"
gbAutoUpdate, "التحقق من التحديث"
gbLicenseReseller, "معلومات الموزع"
lblAutoUpdateWarningBASE, "تحذير: التحديثات التلقائية هي معطلة حاليا، لن يتم مطالبتك بتثبيت اصدارات جديدة"
lblLanguageGetMore, "الحصول على لغات جديدة ومحدثة"
lblLicenseExpires, "تاريخ انتهاء الترخيص:"
lblLicenseKey, "مفتاح الترخيص:"
lblLicenseTo, "مرخص لـ:"
tabAbout, "حول"
tabLanguage, "اللغات"
tabLicense, "مفتاح الرخصة"
tabOptions, "الخيارات"
tabOurApps, "تطبيقاتنا"
tabTroubleshooting, "استكشاف الاخطاء واصلاحها"


[BFFormSettings_Strings]
ChangeToFreeFromPaidPrompt, "هل أنت متأكد من أنك تريد إزالة مفتاح الترخيص والتبديل إلى الإصدار المجاني؟"
ChangeToFreeFromTrialPrompt, "إذا كنت ترغب في استخدام إصدار تجريبي من Pro مرة أخرى ، فستحتاج إلى طلب مفتاح تجريبي جديد من فريق الدعم لدينا. إذا كنت ترغب في معرفة الميزات غير المتوفرة في الإصدار المجاني ، يرجى زيارة صفحة Free vs Pro على موقع الويب. هل أنت متأكد من أنك تريد إزالة مفتاح الترخيص والتبديل إلى الإصدار المجاني؟"
DebugLogCleared, "تم مسح ملف سجل التصحيح بنجاح"
DebugLogNotFound, "تعذر العثور على ملف سجل التصحيح\nتاكد انك قمت بتمكين تسجيل التصحيح اولا"
FreeVersion, "الاصدار المجاني"
LanguageHelpMessage, "أود أن أساعد في إنهاء الترجمة!"
LanguageHelpMessageDescription, "ساعدنا في الانتهاء من الترجمة، واحصل على رخصة Pro Standard مجانا في المقابل. \nسوف يتواصل معك شخص ما في غضون يومي عمل."
LanguageRightToLeft, "من اليمين إلى اليسار"
LicenseKeyRequestTrialDescription, "شخصا سوف يتابعكم خلآل يومين عمل."
LicenseKeyRequestTrialMessage, "اود طلب مفتاح رخصة تجريبية جديد. شكرا!"
LogLevel0, "تسجيل الدخول:معطل"
LogLevel1, "تسجيل الدخول: الهامة فقط"
LogLevel2, "تسجيل الدخول: مفصل"
LogLevel3, "تسجيل الدخول: كل الخطوط"
RegistryExportSuccess, "تم تصدير اعداداتك بنجاح"
RestoreSettingsFailed, "فشل في استعادة اعداداتك"
RestoreSettingsPrompt, "لا تقم باستعادة النسخ الاحتياطية التي لم يتم إنشاؤها من قبلك أو فريق دعم Binary Fortress. \nهل أنت متأكد من أنك ترغب في استعادة هذه النسخة الاحتياطية؟"
RestoreSettingsSuccess, "تمت استعادة اعداداتك بنجاح"
SettingsLoadError, "حدث خطا اثناء تحميل الاعدادات"
SettingsSaveError, "حدث خطا اثناء حفظ الاعدادات"
Title, "الاعدادات"
TroubleshootingCopyError, "فشل في نسخ معلومات استكشاف اخطاءك واصلاحها"
TroubleshootingCopySuccess, "تم نسخ معلومات استكشاف اخطاءك واصلاحها بنجاح الى الحافظة"


[BFFormSupportRequest_Controls]
btnAttachmentsAdd, "إرفاق ملف"
btnAttachmentsClear, "مسح المرفقات"
chkIncludeBackup, "تضمين نسخة احتياطية من الإعدادات مع طلب هذا الدعم."
lblEmailAddress, "عنوان البريد الكتروني"
lblMessage, "رسالة:"
lblName, ":الأسم"
lblSubject, "الموضوع:"
lblWarning, "سيتم تشفير المعلومات من علامة التبويب استكشاف الاخطاء واصلاحها وملف Debug.log الخاصة وارسل جنبا الى جنب مع طلب الدعم هذا حتى نتمكن من حل مشكلتك بسرعة اكبر."


[BFFormSupportRequest_Strings]
EnterEmailAddress, "الرجاء ادخال عنوان بريد الكتروني صالح وحاول مرة اخرى"
EnterMessage, "الرجاء ادخال الرسالة وحاول مرة اخرى"
EnterName, "الرجاء ادخال اسمك وحاول مرة اخرى"
EnterSubject, "الرجاء ادخال موضوع"
PromptClearAttachments, "هل تريد بالتأكيد إزالة هذه المرفقات؟"
SendSuccess, "تم إرسال معلوماتك بنجاح. \nسوف يتصل بك شخص ما في غضون يومي عمل."
Title, "تقديم طلب الدعم"
TooLongEmailAddress, "الرجاء ادخال عنوان بريد الكتروني اقصر وحاول مرة اخرى"
TooLongName, "الرجاء ادخال اسم اقصر وحاول مرة اخرى"


[BFFormUpdateInvalidLicense]
btnBuyNow, "شراء رخصة Pro"
btnLater, "ربما لاحقا"
btnMoreInfo, "المزيد من المعلومات"
lblInvalidLicense, "يبدو أن مفتاح ترخيص Pro غير صالح، \n\nيرجى التحقق من إدخال مفتاح الترخيص الصحيح في علامة التبويب مفتاح الترخيص في نافذة الإعدادات. \n\nإذا كان مفتاح الترخيص صحيحا وكنت لا تزال ترى هذه الرسالة، يرجى الاتصال بدعم Binary Fortress باستخدام زر المساعدة أدناه."
Title, "مفتاح الترخيص باطل"


[BFFormUpdate_Controls]
btnChangeLog, "عرض سجل التغيير"
btnDownloadOnly, "تحميل فقط"
btnInstallNow, "تثبيت الان"
btnInstallOnExit, "تثبيت عند الانتهاء"
btnRemindMeLater, "ذكرني لاحقا"
btnSkipThisVersion, "تخطى هذا الاصدار"
lblNewVersion, "اصدار جديد:"
lblOldVersion, "الاصدار الحالي:"
lblUpdateNotes, "ما الجديد في هذا الاصدار"
lblUpdateSize, "حجم التحديث:"


[BFFormUpdate_Strings]
ConfirmSkipVersion, "من المستحسن تحديث هذا الاصدار الجديد\nهل تريد تخطي التحديث؟"
DownloadFailedSave, "فشل في حفظ هذا الملف محليا"
DownloadingUpdate, "تحميل التحديث"
DownloadInvalidData, "ارجاع البيانات الباطلة من الخادم قد يكون لدى الخادم مشكلة في العثور على الملف المطلوب"
DownloadNoData, "لا يوجد بيانات تم ارجاعها من موقع الويب"
ErrorDownload, "حدث خطا اثناء محاولة تحميل الاصدار الجديد"
FreeNotice, "هذا التحديث وجميع التحديثات المستقبلية مجانا! حدث اليوم وتمتع"
RebootMightBeRequiredWarning, "قد يكون مطلوب إعادة تشغيل بعد تثبيت هذا التحديث."
Title, "التحديث المتوفر"
UpdateProMessage, "تحتاج الى الترقية الى ترخيص محترف لاستخدام التحديث بنقرة واحدة.\n هل تريد المزيد من المعلومات حول الترقية؟"


[BFHelpButton_Controls]
mniDiscussions, "مناقشات المجتمع"
mniOnlineHelp, "تعليمات عبر الانترنت"
mniSupportRequest, "طلب الدعم"


[BFHotKey]
ButtonRemoveInvalidHotKey, "إزالة مجموعة المفاتيح غير صالح"
ErrorHotKeyBindFailed, "تخصيص تركيبة المفاتيح فشل"
ErrorHotKeyComboInUse, "تركيبة المفاتيح قد تكون قيد الاستخدام. هناك عدة اسباب لماذا يمكن ان تفشل:\n- مفتاح نشط اخر يستخدم بالفعل هذه المجموعة من المفاتيح\n- تطبيق اخر يستخدم بالفعل هذه المجموعة من المفاتيح\n- المدمج في وظيفة ويندوز تستخدم هذه المجموعة من المفاتيح"
ErrorIncorrectKeyValue, "تركيبة المفاتيح باطلة، الرجاء اعادة المحاولة"
ErrorIncorrectNumberElements, "تركيبة المفاتيح باطلة: عدد خاطئ من المفاتيح."
ErrorIncorrectNumberKeyMods, "تركيبة المفاتيح باطل: عدد خاطئ من العوامل (معدلات)."
ErrorInvalidKeyCombo, "تركيبة المفاتيح المحددة باطلة."
ErrorSystemReserved, "تركيبة المفاتيح التي تم تحديدها محجوزة من قبل ويندوز ولا يمكن استخدامها."
ErrorTooManyModifiers, "تركيبة المفاتيح باطلة: عدد كبير جدا من العوامل (معدلات)."
HotKeyButtonRemove, "حذف"
HotKeyButtonSetHotKey, "تعيين هوتكي"
HotKeyLabelKeys, "اختر المعدلات ثم ادخل المفتاح المطلوب"
HotKeyLabelMouse, "اختر المعدلات ثم انقر فوق زر الماوس المطلوب"


[BFMessage]
btnCopy, "نسخ الى الحافظة"
btnMoreInformation, "اظهار المزيد من المعلومات"


[BFTextQuery]
CaseSensitive, "حساسة الاحرف:"
ErrorBracketMismatch, "خطأ: عدم تطابق الأقواس. \nيرجى إغلاق الأقواس أو احتواء الاستعلام في علامات الاقتباس."
ErrorEscapeCharAtEnd, "خطأ: الرمز '\' موجود في نهاية الاستعلام.\nالرجاء تجاوز الرمز أو حذفه."
ErrorExpectedMatchCountChar, "خطأ:':::cbc:::' متوقع في الموضع {0}. \nالرجاء إغلاق الأقواس أو احتواء الاستعلام الخاص بك في علامات الاقتباس."
ErrorExpectedQuote, "خطا: '"' متوقع في الموقع {0}. \n الرجاء التاكد من لهروب'"' الاحرف"
ErrorInvalidChar, "خطا: حرف باطل '{0}' في موقف {1}\n يرجى التفاف في الاقتباس"
ErrorInvalidDigit, "خطا: رقم باطل في الموقع {0}. \n ارقام يجب ان تكون ايجابية وتحتوي احرف رقمية فقط"
ErrorInvalidWordBoundary, "تحذير: أحرف غير صالحة.\nيتم دعم الحروف والأرقام فقط بواسطة عامل المساواة."
MayContain, "قد تحتوي على:"
MayEqual, "قد تساوي:"
MayNotContain, "قد لا تحتوي على:"
MayNotEqual, "قد لا يساوي:"
MustContain, "يجب ان تحتوي على:"
MustEqual, "يجب ان يساوي:"
MustNotContain, "يجب ان لا تحتوي على:"
MustNotEqual, "يجب ان لا يساوي:"
Time, "مرة واحدة"
Times, "{0} مرات"


[BFUpdateCheck]
AlreadyInProgress, "التحقق من تقدم التحديث..."
ErrorRunningDownloadedFile, "حدث خطا اثناء محاولة تشغيل ملف التثبيت الذي تم تنزيلة"
FailedToGetVersion, "تعذر تحميل رقم اصدار احدث"
NoUpdate, "انت تستخدم احدث اصدار"


[cFunctions_Strings]
FolderNotRecognized, "لم يتم التعرف على المجلد المحدد ولا يمكن البحث فية"


[CommonControls]
chkIsMetroApp, "هل هذا التطبيق مترو (العالمي) التطبيقات؟"
lblMetroAppID, "عملية معرف التطبيق:"


[frmMain_Controls]
btnBrowseAppendExcludePath, "استعرض وذيل"
btnBrowseExcludePath, "استعراض"
btnFolderBrowse, "استعراض"
btnFolderBrowseAppend, "استعرض وذيل"
btnNewSearch, "بحث في علامة تبويب جديدة"
btnPause, "مه&لة"
btnResume, "الملخص"
btnSearch, "بحث"
btnStop, "قف"
chkCaseSensitive, "استعلام حساسة حالة الاحرف"
chkFileSizeMax, "الحجم الاقصى للملف:"
chkFileSizeMin, "الحجم الادنى للملف:"
chkIsQueryRegEx, "استعلام RegEx"
chkSearchSubFolders, "بحث في المجلدات الفرعية"
chkShowFirstResult, "اظهار النتيجة الاولى فقط لكل ملف"
chkShowIncludeFilterMatchFiles, "اظهار اسماء الملفات التي تجاري "يتضمّن الملفات" مرشح"
chkShowIncludeFilterMatchFolders, "اظهار اسماء المجلدات التي تجاري "يتضمن الملفات" مرشح"
chkShowQueryMatchFiles, "اظهار اسماء الملفات المطابقة لنص الاستعلام"
chkShowQueryMatchFolders, "اظهار اسماء المجلدات المطابقة لنص الاستعلام"
chkUseIFilters, "(محتويات ملف العملية باستخدام معالجات الملفات(ابطا"
colDateAccessed, "تاريخ الوصول"
colDateCreated, "تاريخ الانشاء"
colDateModified, "تاريخ التعديل"
colEncodingUsed, "ترميز المستخدمة"
colExtension, "الامتداد"
colFile, "اسم الملف"
colFileSize, "حجم الملف"
colLine, "سطر"
colLineNumber, "سطر#"
colPath, "مسار"
lblAccessedTo, "الى"
lblAdditionalLinesAfter, "اظهار العديد من هذه الخطوط بعد نتيجة البحث:"
lblAdditionalLinesBefore, "اظهار العديد من هذه الخطوط قبل نتيجة البحث"
lblCreatedTo, "الى"
lblDateAccessed, "تاريخ الوصول:"
lblDateCreated, "تاريخ الانشاء:"
lblDateFilterLogic, "تاريخ تصفية المنطق:"
lblDateModified, "تاريخ التعديل:"
lblExcludeFiles, "استثن الملفات:"
lblExcludePath, "استثن المسارات:"
lblFilterResults, "تصفية:"
lblIncludeFiles, "تضمين &الملفات:"
lblModifiedTo, "الى"
lblPath, "&مسارات:"
lblQuery, "&استعلام:"
lblStatusFound, "{تم العثور على المتطابقات:{0"
lblStatusTotal, "{الملفات المبحوث عنها{0"
mniAbout, "حول"
mniAddResultsToZipFile, "تجميع جميع النتائج في ملف Zip"
mniAddSelectedResultsToZipFile, "تجميع النتائج المحددة في ملف Zip"
mniClearSearchHistory, "تنظيف تاريخ البحث"
mniCloseAll, "اغلق الكل"
mniCloseAllButThis, "اغلق الاخرين"
mniCloseSearch, "اغلاق"
mniCopyFilePathNewLine, "نسخ أسماء الملفات المحددة (فصل سطر جديد)"
mniCopyToClipboard, "نسخ النتائج المحددة"
mniCopyToClipboardAll, "نسخ كل النتائج"
mniExit, "خروج"
mniExplorerContextMenu, "قائمة سياق الوندوز"
mniHashWithHashTools, "تجزئة مع HashTools"
mniHelp, "تعليمات"
mniOpenFolder, "افتح المجلد الذي يحتوي على"
mniOpenFolderOnly, "افتح المجلد"
mniOpenOther, "فتح مع {0}"
mniPermenentDelete, "حذف الملفات المحددة بشكل دائم"
mniRemoveRows, "ازالة النتائج المحددة من القائمة"
mniRenameFile, "إعادة تسمية الملف المحدد."
mniSettings, "الاعدادات"
mniShowFilterControls, "اظهار عنصر تحكم التصفية"
mniTextCopy, "نسخ"
mniTextSelectAll, "حدد الكل"
mniTools, "الادوات"
mniTrayExit, "خروج"
mniTrayLoadProfiles, "حمل السيرة"
mniTrayShowFileSeek, "اظهار FileSeek"
mniTraySyncProfiles, "مزامنة السيرة"
mnuCopyFilePath, "نسخ "اسماء الملفات المحددة" (مفصولة بفاصلة)"
mnuExportAllHTML, "تصدير كل النتائج الى HTML"
mnuExportSelectedResultsHTML, "تصدير النتائج المحددة الى HTML"
mnuFileCopy, "نسخ الملفات المحددة"
mnuFileCut, "قص الملفات المحددة"
mnuFileDelete, "حذف الملفات المحددة"
mnuLanguage, "اللغات"
mnuLoadProfile, "حمل"
mnuManageProfiles, "ادارة السيرة"
mnuOpen, "افتح"
mnuOpenNotepad, "افتح باستخدام المفكرة"
mnuProfile, "السيرة"
mnuSave, "حفظ"
mnuSaveAll, "CSV تصدير كل النتائج بصيغة"
mnuSaveProfile, "حفظ سيرة جديدة"
mnuSaveSelection, "CSV تصدير النتائج المحددة بصيغة"
mnuShowFullLanguageList, "اظهار القائمة كاملة"
mnuSyncProfiles, "مزامنة السيرة"
rdoMatchQueryLineByLine, "تطابق الاستعلام لكل سطر ملف"
rdoMatchQueryToWholeFile, "تطابق الاستعلام الى الملف باكملة"
tabAdvanced, "متقدم"
tabDateFilters, "تاريخ التصفية"
tabFileSizeFilters, "حجم ملف التصفية"
tabSearch, "بحث"


[frmMain_Strings]
AccessedAfterTT, "{الوصول اليها بعد{0"
AccessedBeforeTT, "{الوصول اليها قبل{0"
AccessedBetweenTT, "{الوصول اليها بين {0} و {1"
AllDrives, "جميع الاقراص"
AppSelectionErrorPartOne, "لايمكن العثور على التطبيق الذي حددتة"
AppSelectionsErrorPartTwo, "هل تريد تحديد كلمة سر مختلفة الان؟"
btnNewSearchTT, "فتح علامة تبويب جديدة وبدء البحث"
btnSearchTT, "بدء البحث في علامة التبويب الحالية"
btnStopTT, "ايقاف البحث المحدد"
CaseSensitiveQueryTT, "استعلام حساسة حالة الاحرف"
cboDateFilterLogic_AND, "AND"
cboDateFilterLogic_OR, "OR"
cboExcludeFileFilterMode_Pattern, "استثن مرشح ملفات نمط"
cboExcludeFileFilterMode_RegEx, "استثن مرشح ملفات RegEx"
cboExcludeFileFilterMode_TextQuery, "استثن مرشح ملفات استفسار النص"
cboIncludeFileFilterMode_Pattern, "تضمين مرشح ملفات نمط"
cboIncludeFileFilterMode_RegEx, "تضمين مرشح ملفات RegEx"
cboIncludeFileFilterMode_TextQuery, "تضمين مرشح ملفات استفسار النص"
cboQueryMode_RegEx, "استعلام RegEx"
cboQueryMode_TextQuery, "الاستفسار استفسار النص"
chkShowFirstResultTT, "سوف يظهر اول سطر متطابق فقط عند مطابقة الاستعلام لكل سطر"
ColumnChangeMessage, "التغييرات التي ادخلت على الاعمدة نتيجة البحث لن يتم حتى تقوم باعادة تشغيل عمليات بحثك"
ContextMenuError, "حدث خطا اثناء عرض قائمة سياق الويندوز"
CreatedAfterTT, "{التي تم انشاؤها بعد {0"
CreatedBeforeTT, "{التي تم انشاؤها قبل {0"
CreatedBetweenTT, "{التي تم انشاؤها بين {0} و {1"
CSVSpreadsheet, "CSV ملفات"
CustomAppOpenError, "حدث خطا اثناء فتح هذا الملف مع التطبيق المخصص"
DateCreatedError, "الرجاء تحديد تاريخ انشائه نهاية تاريخ هذا هو التاريخ يتجاوز البداية"
DateFiltersSelected, "تاريخ التصفية:"
DateModifiedError, "الرجاء حدد تاريخ تعديل تاريخ الانتهاء هذا هو يتجاوز البداية التاريخ"
EmptyPDFError, "ملف المستند المحمول فتش لكن لم يحتوى اي نص"
EnterProfileName, "ادخل اسما لالسيرة:"
ErrorDirectoryEmpty, "هذا المسار فارغ"
ExcludeFilesTT, "{استبعاد الملفات: {0"
ExcludePathsTT, "{استبعاد مسارات: {0"
ExportDateAccessed, "تاريخ التشغيل الأخير"
ExportDateCreated, "تاريخ الإنشاء"
ExportDateModified, "تاريخ التعديل"
ExportExtension, "الإمتداد"
ExportFileName, "‏ْاسم الملف"
ExportFileSize, "حجم الملف"
ExportLineNumber, "رقم السطر"
ExportLineText, "السطر"
ExportPath, "المكان"
FileDeleteMessage, "بالعملية المطلوبة FileSeek الرجاء الانتظار بينما يقوم\nيمكنك اغلاق هذة النافذة ولكن قد يؤدي الى نتائج غير متوقعة اثناء تشغيل هذة المهمة"
FileDeleteQuestion, "هل انت متاكد تريد حذف الملفات او المجلدات المحددة؟"
FileDeleteTitle, "حذف الملفات"
FileDeletionError, "حدث خطا اثناء حذف هذه الملفات"
FileHandlerError, "الرجاء ادخال مسار للبحث"
FileIncludeNameMatch, "[تطابق اسم الملف [تتضمن عامل تصفية ملفات"
FileOpenError, "حدث خطا اثناء فتح هذا الملف"
FilePermenentDeleteQuestion, "هل تريد حذف الملفات او المجلدات المحددة بشكل دائم؟"
FileQueryNameMatch, "[تطابق اسم الملف [الاستعلام"
FileReadError, "{خطا في الوصول الى الملف: {0"
FileSelectionError, "الرجاء تحديد ملف على الاقل 1 موجود وحاول مرة اخرى"
FileSizeError, "الرجاء حدد "الملف الحجم الاقصى" مساوية او اكبر من "الحد الادنى لحجم الملف"
FileSizeFiltersSelected, "حجم ملف التصفية"
FilesSearched, "{الملفات المبحوث عنها{0"
FilesSkipped, "تخطي الملفات: {0}"
FolderBrowserDescription, "حدد مجلد المراد البحث فية"
FolderBrowsingError, "حدث خطا اثناء التصفح للوصول الى مجلد"
FolderIncludeNameMatch, "[تطابق اسم المجلد [تتضمن عامل تصفية ملفات"
FolderItemError, "{فشل في الحصول على مجلد للبند: {0"
FolderOpenError, "حدث خطا اثناء فتح هذا المجلد"
FolderQueryNameMatch, "[تطابق اسم المجلد [نص الاستعلام"
FolderReadError, "{حدث خطا اثناء قراءة المجلدات في المجلد: {0"
HiddenFolderError, "لم يفتش لانه ملف/ مجلد مخفي"
HyperTextMarkupLanguageFile, "ملف اللغة تاشير النصوص الموصولة"
IFilterWarning, "{الرجاء تمكين معالجات الملفات ضمن علامة التبويب خيارات متقدمة لعرض النتائج الصحيحة ل: الملفات: {0"
IncludeFilesTT, "تضمين الملفات: {0{"
InvalidExcludeFilesRegExError, "يتم استبعاد ملفات RegEx نمط صالحة\n{0}"
InvalidFolderLength, "طول المجلد باطل"
InvalidIncludeFilesRegExError, "وتشمل ملفات RegEx نمط هو باطل\n{0}"
InvalidQueryError, "نص استعلامك هو باطل. \n {0}"
InvalidQueryRegExError, "نمط RegEx الاستعلام هو باطل\n{0}"
KeypressError, "حدث خطا اثناء معالجة هذا ضغطه مفتاح"
LinkedFolderError, "عدم البحث في المجلد لانها مفترق الارتباط"
MatchesFound, "{تم العثور على المتطابقات:{0"
MatchesFromQueue, "النتائج بقائمة الانتظار: {0}"
MatchesFromQueueIcons, "الايقونة بقائمة الانتظار: {0}"
MaxFileSizeTT, "{اقصى حجم للملف: {0"
MaxPathError, "هذا مسار طويل، وقد لا تعمل بعض البرامج"
MenuOpenError, "حدث خطا اثناء فتح القائمة"
MinFileSizeTT, "{حجم الملف الحد الادنى: {0"
ModifiedAfterTT, "{تعديل بعد {0"
ModifiedBeforeTT, "{تم التعديل من قبل: {0"
ModifiedBetweenTT, "{تعديل بين {0}و{1"
More, "(اكثر)"
NoDateFiltersSelected, "لا توجد تصفية في التاريخ المحدد"
NoFileSizeFiltersSelected, "لا توجد تصفية لحجم الملف المحدد"
NoOptionsSelected, "لا الخيارات المحددة"
NotepadError, "حدث خطا اثناء فتح هذا الملف باستخدام المفكرة"
NotYourProfile, "انك لا تملك هذه الشخصية"
OnlyShowFirstResultTT, "فقط اظهار النتيجة الاولى"
OpenManyQuestion, "هل انت متاكد من انك سوف مثل فتح {0} الملفات او المجلدات؟"
OptionsSelected, "الخيارات المحددة:"
OtherApplication, "تطبيق اخر"
PathsTT, "{مسارات: {0"
PathTooLongError, "لا يعتمد الوندوز هذا الاجراء باستخدام اسماء المسار طويل"
ProfileLoadError, "حدث خطا اثناء تحميل السيرة هذا"
ProfileLoadOnStartError, "حدث خطا اثناء تحميل السيرة هذا. السيرة غير موجود"
ProfileNameEmptyError, "لم تقم بإدخال اسم ملف تعريف. يرجى إدخال الاسم والمحاولة مرة أخرى."
ProfileOverwriteQuestion, "هل انت متاكد ترغب في الكتابة فوق السيرة '{0}'؟"
ProfileSaved, "{حفظ اعدادات البحث على السيرة '{0"
ProfileSaveError, "غير قادر على حفظ السيرة"
ProOnlyDoubleClickPrompt, "ميزة فقط FileSeek Pro يمكنك تعيين معالج النقر بنقر افتراضي مزدوج\nيمكنك تغيير معالج النقر بنقر افتراضي مزدوج من اعدادات> تبويب البحث\nهل تود المزيد من المعلومات حول الترقية"
QueryTT, ":استعلام\n{0}"
rdoMatchQueryLineByLineTT, "فتح ملف خط واحد في وقت واحد، وفي محاولة لمطابقة الاستعلام لكل سطر"
rdoMatchQueryToWholeFileTT, "فتح الملف باكمله في وقت واحد، وفي محاولة لمطابقة الاستعلام للنص باكمله"
RenameFileError, "لم يتمكن FileSeek من إعادة تسمية الملف أو المجلد المحدد. \nيرجى كتابة اسم مختلف وإعادة المحاولة."
RenameFileFolder, "إعادة تسمية الملف المحدد:"
ResultCopied, "احدى نتائج النسخ للحافظة"
ResultCopyError, "حدث خطا اثناء نسخ نتائج بحثك للحافظة"
ResultSaveError, "حدث خطا اثناء حفظ نتائجك\n{0}"
ResultsCopied, "{0} نتائج النسخ للحافظة"
ResultSelectionError, "الرجاء تحديد نتيجة البحث 1 على الاقل، وحاول مرة اخرى"
SaveResults, "حفظ النتائج الى جدول البيانات"
SaveResultsAsHTML, "HTML حفظ النتائج كملف"
SaveSearchProfile, "حفظ سيرة البحث"
SearchComplete, "{0} s بحث انجز في"
SearchCriteria, "معايير البحث:"
SearchCriteriaEmptyTT, "البحث عن معايير فارغة"
SearchEnd, "نهاية البحث: {0}"
SearchError, "حدث خطا اثناء البحث"
SearchStart, "بداية بحث: {0}"
SearchSubFoldersTT, "بحث في المجلدات الفرعية"
SettingFormShowError, "لقد حدث خطا اثناء عرض نافذة الاعدادات"
Syncing, "المزامنة مع حساب Binary Fortress..."
SystemFolderError, "عدم البحث لانه ملف او مجلد نظام"
TextCopyError, "حدث خطا اثناء نسخ هذا النص"
TextProcessingError, "حدث خطا اثناء معالجة النص"
TextQueryHelpTT, "تعليمات نص السؤال"
TextSelectionError, "الرجاء حدد بعض النص وحاول مرة اخرى"
txtPathTT, "فصل عناصر متعددة مع | حرف"
UseFileHandlersTT, "استخدام معالجات الملفات"
ViewingAppPartOne, "انت لم تقم بتحديد تطبيق عرض حتى الان"
ViewingAppPartTwo, "هل تريد تحديد احد الان؟"
ZipFile, "ملف Zip"


[frmProfileManager_Controls]
btnCopyProfile, "نسخ السيرة"
btnDelete, "حذف"
btnExport, "تصدير السيرة"
btnImport, "استيراد السيرة"
btnRename, "اعادة التسمية"
btnSync, "المزامنة مع حساب Binary Fortress الخاص بك"
colProfileName, "اسم السيرة"
colProfileOwner, "مالك السيرة"
lblCurrentProfile, "{المستخدم الحالي{0"


[frmProfileManager_Strings]
CopyProfileNameQuestion, "ماذا تحب دعوة ملف سيرتك الجديدة؟"
ExportFileSeekSearchProfile, "FileSeek تصدير ملف سيرة البحث"
ExportSearchProfileSuccessful, "صدرت سيرة البحث بنجاح"
FileSeekSearchProfile, "FileSeek سيرة بحث"
ImportFileSeekSearchProfile, "سيرة البحث FileSeek استيراد"
MustSelectAnItem, "الرجاء تحديد السيرة من القائمة، وحاول مرة اخرى"
ProfileDeleteQuestion, "هل ترغب في حذف السيرة المحدد؟"
RenameSearchProfile, "اعادة تسمية السيرة البحث"
SearchProfileName, "البحث عن اسم السيرة:"
Title, "ادارة السيرة"


[frmSettings_Controls]
btnBrowseOther, "استعراض"
btnClearHistory, "تنظيف تاريخ البحث"
btnIFilterToggle, "معالج ملف التبديل"
btnOtherDefault, "&افتراضي"
chkCloseToTray, "اغلاق FileSeek الى علبة النظام"
chkCombineParameters, "نقل ملفات متعددة الى نفس المثيل، بدلا من فتح مثيلات متعددة"
chkErrorDirectoryEmpty, "اظهار الخطا عندما يتم العثور على مجلد فارغ"
chkErrorForLongPaths, "اظهار الخطا وتخطي المسار عندما الطول اكثرمن 260 حرفا"
chkExportExtraLines, "ايضا تصدير خطوط اضافية عند حفظ نتائج البحث"
chkIFilterErrors, "اظهار خطا للملفات مع اي معالج الملف (عندما يتم تمكين ملف معالج البحث("
chkIsQueryFullString, "علاج نص الاستعلام كمصطلح الاستعلام كبير واحد"
chkLinkedFoldersSearch, "البحث في ملفات و المجلدات الموجودة على مفترق ارتباط"
chkLinkedFoldersSearchShowErrorOnSkip, "اظهار الخطا عند تخطي مفترق الارتباط"
chkMinimizeToTray, "تقليل FileSeek الى علبة النظام"
chkOnlyShowMatchedText, "فقط اظهار النص المطابق في نتيجة البحث"
chkResetSearchValues, "إعادة تعيين قيم علامة تبويب البحث عند بدء عملية بحث في علامة تبويب جديدة"
chkResultWordWrap, "التفاف النص الذي يظهر في نتائج البحث"
chkSearchHiddenFiles, "بحث عن ملفات و &المجلدات المخفية"
chkSearchSystemFiles, "بحث عن ملفات النظام و&المجلدات"
chkSearchWithinLNKFiles, "ابحث عن ملفات LNK التي تشير إلى"
chkShowErrorEmptyPDF, "اظهار الخطا عندما يجد ملف المستندات المحمولة فارغ"
chkShowFileErrors, "اظهار خطا عندما لا يمكن الوصول الى ملف/مجلد"
chkShowHiddenFileError, "اظهار الخطا عندما تتخطي الملفات المخفية و &المجلدات"
chkShowSystemFileError, "اظهار الخطا عندما تتخطي ملفات النظام و& المجلدات"
chkShowToolTips, "اظهار شريط التلميح"
chkSingleInstance, "اجبار FileSeek لفتح مثيل واحد فقط"
chkStartWithClearProfile, "يبدا FileSeek دائما مع معايير البحث الفارغة"
chkTreatAllExcludePathFiltersAsWildcards, "معاملة كافة عوامل التصفية استبعاد مسار كاحرف بديلة"
chkTreatAllIncludeFiltersAsWildcards, "التعامل مع كافة الملفات التي تتضمن عوامل التصفية كاحرف البدل"
chkUseCustomDateFormat, "استخدام تنسيق تاريخ مخصص"
chkUsePreviewHandlers, "استخدام معالجات المعاينة في جزء النتائج"
chkWindowsContextMenu, "اظهار FileSeek في قائمة سياق النوافذ"
colAvailableColumns, "الاعمدة المتوفرة"
colSelectedColumns, "الاعمدة المحددة"
gbCmdLineVars, "متغيرات سطر الاوامر"
gbDateFormat, "تنسيق التاريخ"
gbGeneralOptions, "خيارات عامة"
gbPresentationOptions, "خيارات العرض"
gbSearchColumns, "اعمدة البحث"
lblCmdLineParam, "معلمات سطر الاوامر للتمرير:"
lblDateFormatLink, "سلاسل تنسيق الوقت والتاريخ المخصصة"
lblDefaultDoubleClick, "تحديد العملية الافتراضية عند النقر المزدوج على نتيجة البحث:"
lblFileHandlerFAQ, "معالج الملف الأسئلة المتداولة"
lblNumChar, "اظهار هذا العدد من الاحرف لكل نتيجة:"
lblOtherApplicationName, "اسم لتطبيق اخر:"
lblSelectViewingApp, "عرض تطبيق الملف المحدد:"
lblSkipFile, "الحد الاقصى للوقت البحث المسموح لكل ملف (0 = غير محدود):"
pageSearchViewSettings, "نتيجة عرض اعدادات"


[frmSettings_Strings]
AppBrowsingError, "حدث خطا اثناء التصفح لاحد تطبيقات"
cboDefaultDoubleClickOperation_ExportAllCSV, "تصدير كل النتائج الى CSV"
cboDefaultDoubleClickOperation_ExportAllHTML, "تصدير كل النتائج الى HTML"
cboDefaultDoubleClickOperation_ExportSelectedCSV, "تصدير النتائج المحددة الى CSV"
cboDefaultDoubleClickOperation_ExportSelectedHTML, "تصدير النتائج المحددة الى HTML"
cboDefaultDoubleClickOperation_Open, "مفتوحة مع معالج افتراضي"
cboDefaultDoubleClickOperation_OpenContainingFolder, "افتح المجلد الذي يحتوي على"
cboDefaultDoubleClickOperation_OpenNotepad, "افتح باستخدام المفكرة"
cboDefaultDoubleClickOperation_OpenOther, "فتح مع {0}"
chkTreatAllIncludeFiltersAsWildcardsTT, "*foo* مع تمكين هذا الخيار، سيتم التعامل مع بحث تم ادخالها"
ClearHistoryError, "حدث خطا اثناء مسح سجل بحثك"
ClearHistoryWarning, "هل انت متاكد من انك تريد مسح سجل بحثك؟"
CommandLineError, "الرجاء ادخال معلمات سطر الاوامر، او انقر فوق 'الافتراضي' لاعادة تعيينهم"
CustomDateFormatError, "هناك خطا تعيين تنسيق التاريخ المخصصة. \ الرجاء تصحيح الخطا واعادة المحاولة"
DisableFileHandler, "تعطيل معالج الملف"
DisablePreviewHandler, "تعطيل معاينة المعالج"
EnableFileHandler, "تمكين معالج الملف"
EnablePreviewHandler, "تمكين معاينة المعالج"
FileCommandDescription, "{0}: استبدال اسم الملف الكامل"
FileHandlerListError, "حدث خطا اثناء ادراج معالجات الملفات"
FileHandlerSelectError, "حدث خطا اثناء تحديد معالج الملف هذا"
FileHandlerToggleError, "لقد حدث خطا اثناء تبديل معالج الملف هذا"
HistoryCleared, "مسح تاريخ البحث بنجاح"
InvalidExitcode, "{رمز الخروج المعاد: باطل {0"
LineCommandDescription, "{0}: استبدال رقم السطر"
lvIFilters_Extension, "الامتداد"
lvIFilters_Handler, "المعالج"
lvIFilters_HandlerVersion, "الاصدار"
NumOfCharError, "الرجاء ادخال عدد من الاحرف بين {0} و {1}، وحاول مرة اخرى"
PreviewHandlerListError, "حدث خطا اثناء سرد معالجات معاينة."
PreviewHandlerToggle, "تبديل معاينة المعالج"
SettingMenuError, "حدث خطا اثناء تعيين اعدادات قائمة السياق"
tabSettings_FileHandlers, "معالجات الملفات"
tabSettings_OtherApp, "تطبيق اخر"
tabSettings_PreviewHandlers, "معالجات المعاينة"
tabSettings_Search, "بحث"


[HTMLExport_Strings]
OpenSavedSearchResultsQuestion, "تم حفظ نتائج البحث بنجاح\nهل ترغب في عرض الملف"
SearchCriteria, "معايير البحث"
SearchDate, "تاريخ البحث:"
Title, "FileSeek نتائج البحث"


[IFilterHelper_Strings]
UnknownError, "خطا غير معروف للتصفية"
UsingStandardMethodWarning, "لايوجد ملف معالج لهذا الملف البحث باسلوب قياسي"


[Installer]
AdditionalIcons, "ايقونات اضافية:"
CreateContextMenuItems, "Windowsاضافة الى قائمة السياق النقر بزر الماوس الايمن ل"
CurrentUserOnly, "للمستخدم الحالي فقط"
DesktopIcon, ""انشا ايقونة على سطح المكتب"
DotNetInstallNow, "هل ترغب في تثبيته الان؟"
DotNetRequired, "يحتاج نظامك إلى تحديث .NET Framework لتشغيل هذا التطبيق."
ForAllUsers, "لكل المستخدمين"
LaunchNow, "تشغيل الان"
LicKeyInvalid, "يبدو مفتاح الترخيص هذا باطل"
LicKeyLabel, "مفتاح الترخيص:"
LicKeySelectOption, "الرجاء تحديد اسلوب ترخيص البرنامج وحاول مرة اخرى."
LicKeyText, "رخصة الخيارات الرئيسية:"
LicKeyTextAdminLocked, "تم تعيين مفتاح ترخيصك الخاص من المسؤول الخاص"
LicKeyTextChangeFree, "انقر فوق 'تغيير الى الاصدار المجاني في نافذة الاعدادات لاستخدام الاصدار المجاني"
LicKeyTextEnterOrFree, "الرجاء ادخال مفتاح ترخيص صالح او اختر 'استخدم نسخة مجانية."
LicKeyTextPaid, "استخدام مفتاح هذا الترخيص:"
LicKeyTextTrial, "استخدام الاصدار التجريبي (اول مرة فقط)، يتحول الى اصدار مجاني بعد 30 يوما"
RunAtStartup, "Windows اطلاق عند بدء تشغيل"
SteamKeyInvalid, "فشل مفتاح الترخيص لم يتم التحميل بشكل صحيح. يرجى الخروج من هذا المثبت / التطبيق ومحاولة الضغط تثبيت او تشغيل مرة اخرى من داخل ستيم"
TextBefore, "قيد التشغيل حاليا الرجاء التاكد من اغلاقة قبل تثبيت هذا الاصدار الجديد FileSeek اذا كان لديك\n\nللتحديثات والدعم https://www.fileseek.ca زيارة"
UninstallRemoveAllData1, "هل ترغب في ازالة كافة اعدادات التطبيق، تفضيلات والملفات المؤقتة؟"
UninstallRemoveAllData2, "لا ينصح بذلك اذا كنت ستقوم بتثبيت هذا التطبيق مرة اخرى."
UnsupportedWindowsVersion, "لم يعد هذا المنتج مدعوما على إصدار ويندوز الخاص بك. هل ترغب في الحصول على مزيد من المعلومات حول تنزيل إصدار أقدم معتمد؟"


[LicenseValidate_Strings]
ExpiredPrompt, "انتهت FileSeek اسف، مفتاح رخصة تقييم\nFileSeek .اذا اشتريت الرخصة، رجاء ادخلها في نافذة اعدادات\n\nFileSeek Pro هل تود المزيد من المعلومات حول شراء"
FreeLicenseReminder, "هل تريد المساعدة في دعم التنمية المستقبلية؟ انقر هنا!"
Invalid, "اسف، مفتاح ترخيصك باطلة"
InvalidReseller, "المزود من قبل بائعك FileSeek اسف، مفتاح رخصتك صحيح فقط مع\nالرجاء الاتصال ببائعك للمزيد من المعلومات"
LicenseProcessPro, "شكرا لكم على التسجيل"
LicenseProcessProRestoreSettingsPrompt, ""تم الكشف عن نسخة احتياطية تلقائية لاعدادات النسخة المدفوعة الخاصة بك.\nعمر النسخة هو {0} يوم /ايام."\nهل تود تحميل اعدادات النسخة المدفوعة؟ كل الاعدادات الحالية سيتم تجاهلها."
LicenseProcessRemoved, "تم ازالة مفتاح ترخيصك"
LicenseProcessTrial, "FileSeek Pro شكرا لكم لمحاولة !\n {0:D} ستنتهي مدة صلاحية ترخيصك في"
TrialAlmostDonePrompt, "رخصة تقييمك ستنتهي قريبا\nFileSeek اذا اشتريت الرخصة، رجاء ادخلها في نافذة اعدادات\n\nFileSeek Pro هل تود المزيد من المعلومات حول شراء"


[WindowsContextMenu_Strings]
SearchWithFileSeek, "FileSeek البحث مع"


[Words]
About, "حول"
Add, "اضافة"
AdminSettingsLock, "يتم ادارة بعض الاعدادات من قبل مسؤول نظامك"
Apply, "تطبيق"
Browse, "استعراض"
ButtonLater, "لاحق"
ButtonMoreInformation, "المزيد من المعلومات"
ButtonUseFreeVersion, "انت تستخدم اصدار مجاني"
BuyALicenseKey, "شراء مفتاح الترخيص"
Cancel, "الغاء الامر"
Close, "اغلاق"
Copy, "نسخ"
Custom, "مخصص"
Cut, "قص"
Default, "افتراضي"
Delete, "حذف"
Disable, "تعطيل"
Disabled, "معطل"
Duplicate, "تكرار"
Edit, "تعديل"
Enable, "تمكين"
Enabled, "ممكن"
EnterALicenseKey, "أدخل مفتاح الترخيص"
Error, "خطا"
ErrorNotAdminUACDisabled, "معطل، لكنك لست مديرا، عملك المطلوب من المحتمل سيفشل UAC\nاو اتصل كمدير وحاول ثانية UAC رجاء مكن\nرجاء تاكد من اعادة تشغيل حاسوبك.UAC اذا عطلت مؤخرا"
Exit, "انهاء"
FileTypes_AllFiles, "كل الملفات"
FileTypes_ApplicationFiles, "ملفات التطبيق"
FileTypes_HTMLFiles, "ملفات HTML"
FileTypes_ImageFiles, "ملفات الصور"
FileTypes_RegistryFiles, "ملفات التسجيل"
FileTypes_SoundFiles, "ملفات الصوت"
FileTypes_VideoFiles, "ملفات الفيديو"
FileTypes_ZipFiles, "الرمز البريدي الملفات"
FreeVsPro, "مجانا مقابل برو"
Help, "تعليمات"
Info, "معلومات"
InvalidImageFile, "نسخة تبدو تالفة، او غير قابل للقراءة"
Language, "لغة"
Load, "حمل"
Name, "الأسم"
NameLabel, ":الأسم"
Never, "ابدا"
No, "لا"
OK, "موافق"
Paste, "لصق"
ProductSocialOnFacebook, "FileSeek على Facebook"
ProductSocialOnLinkedIn, "FileSeek على LinkedIn"
ProductSocialOnTwitter, "FileSeek على تويتر"
ProOnlyButtonToolTip, "هذه الميزة هي Pro فقط! انقر هنا لمزيد من المعلومات."
ProOnlyLabelText, "الترقية إلى ترخيص Pro لتمكين هذه الميزة"
ProOnlyNotice, "يتم تمييز ميزات Pro فقط باللون الأزرق"
ProOnlyQuestion, "تحتاج الترقية إلى رخصة برو لاستخدام هذه الميزة.\nهل تريد المزيد من المعلومات حول الترقية؟"
ProOnlyShort, "Pro فقط"
Redo, "اعادة"
Refresh, "تحديث"
Remove, "حذف"
Rename, "إعادة التسمية"
Retry, "أعد المحاولة"
Save, "حفظ"
Seconds, "ثانية"
Select, "تحديد"
SelectAll, "تحديد الكل"
Settings, "الإعدادات"
Start, "البدء"
Stop, "ايقاف"
Sync, "المزامنة"
Undo, "تراجع"
Unknown, "غير معروف"
Yes, "نعم"